added docs for learning
